IDEA Open Model
SteelSetup Class
Compatible with IDEA StatiCa Beta 20.0
 ISteelSetup
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 More...
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class SteelSetup
Public MustInherit Class SteelSetup
The SteelSetup type exposes the following members.
Constructors
Name | Description
SteelSetup
Initializes a new instance of the SteelSetup class
Top
Methods
Name | Description
FrictionCoefficientPboltDefault
 Friction Coefficient Pbolt Default
Top
See Also
Reference
IdeaRS.OpenModel Namespace
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.SteelSetup
 IdeaRS.OpenModel.SteelSetupAISC
 IdeaRS.OpenModel.SteelSetupAUS
 IdeaRS.OpenModel.SteelSetupCISC
 IdeaRS.OpenModel.SteelSetupECEN
 IdeaRS.OpenModel.SteelSetupHKG
 IdeaRS.OpenModel.SteelSetupIND
 IdeaRS.OpenModel.SteelSetupRUS